load/data/log_2025-02-07_08:31:15_300_ethz.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ethz.js
        output: csv (data/data_2025-02-07_08:31:15_300_ethz.csv)

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m0s max duration (incl. graceful stop):
              * ethz: 300 looping VUs for 30s (exec: run, gracefulStop: 30s)


running (0m01.0s), 300/300 VUs, 108 complete and 0 interrupted iterations
ethz   [   3% ] 300 VUs  01.0s/30s

running (0m02.0s), 300/300 VUs, 871 complete and 0 interrupted iterations
ethz   [   7% ] 300 VUs  02.0s/30s

running (0m03.0s), 300/300 VUs, 1853 complete and 0 interrupted iterations
ethz   [  10% ] 300 VUs  03.0s/30s

running (0m04.0s), 300/300 VUs, 2857 complete and 0 interrupted iterations
ethz   [  13% ] 300 VUs  04.0s/30s

running (0m05.0s), 300/300 VUs, 3909 complete and 0 interrupted iterations
ethz   [  17% ] 300 VUs  05.0s/30s

running (0m06.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  20% ] 300 VUs  06.0s/30s

running (0m07.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  23% ] 300 VUs  07.0s/30s

running (0m08.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  27% ] 300 VUs  08.0s/30s

running (0m09.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  30% ] 300 VUs  09.0s/30s

running (0m10.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  33% ] 300 VUs  10.0s/30s

running (0m11.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  37% ] 300 VUs  11.0s/30s

running (0m12.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  40% ] 300 VUs  12.0s/30s

running (0m13.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  43% ] 300 VUs  13.0s/30s

running (0m14.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  47% ] 300 VUs  14.0s/30s

running (0m15.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  50% ] 300 VUs  15.0s/30s

running (0m16.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  53% ] 300 VUs  16.0s/30s

running (0m17.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  57% ] 300 VUs  17.0s/30s

running (0m18.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  60% ] 300 VUs  18.0s/30s

running (0m19.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  63% ] 300 VUs  19.0s/30s

running (0m20.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  67% ] 300 VUs  20.0s/30s

running (0m21.0s), 300/300 VUs, 4377 complete and 0 interrupted iterations
ethz   [  70% ] 300 VUs  21.0s/30s

running (0m22.0s), 300/300 VUs, 5185 complete and 0 interrupted iterations
ethz   [  73% ] 300 VUs  22.0s/30s

running (0m23.0s), 300/300 VUs, 6323 complete and 0 interrupted iterations
ethz   [  77% ] 300 VUs  23.0s/30s

running (0m24.0s), 300/300 VUs, 7540 complete and 0 interrupted iterations
ethz   [  80% ] 300 VUs  24.0s/30s

running (0m25.0s), 300/300 VUs, 8735 complete and 0 interrupted iterations
ethz   [  83% ] 300 VUs  25.0s/30s

running (0m26.0s), 300/300 VUs, 9952 complete and 0 interrupted iterations
ethz   [  87% ] 300 VUs  26.0s/30s

running (0m27.0s), 300/300 VUs, 11122 complete and 0 interrupted iterations
ethz   [  90% ] 300 VUs  27.0s/30s

running (0m28.0s), 300/300 VUs, 12221 complete and 0 interrupted iterations
ethz   [  93% ] 300 VUs  28.0s/30s

running (0m29.0s), 300/300 VUs, 13360 complete and 0 interrupted iterations
ethz   [  97% ] 300 VUs  29.0s/30s

running (0m30.0s), 300/300 VUs, 14468 complete and 0 interrupted iterations
ethz   [ 100% ] 300 VUs  30.0s/30s

running (0m31.0s), 210/300 VUs, 14622 complete and 0 interrupted iterations
ethz ↓ [ 100% ] 300 VUs  30s

running (0m32.0s), 204/300 VUs, 14628 complete and 0 interrupted iterations
ethz ↓ [ 100% ] 300 VUs  30s

running (0m33.0s), 132/300 VUs, 14700 complete and 0 interrupted iterations
ethz ↓ [ 100% ] 300 VUs  30s

running (0m34.0s), 007/300 VUs, 14825 complete and 0 interrupted iterations
ethz ↓ [ 100% ] 300 VUs  30s

     ✗ is status 200
      ↳  99% — ✓ 14831 / ✗ 1

     checks.........................: 99.99% 14831 out of 14832
     data_received..................: 1.0 GB 29 MB/s
     data_sent......................: 2.2 MB 63 kB/s
     http_req_blocked...............: avg=13.35ms  min=1.87µs  med=3.16µs  max=1.6s     p(90)=4.88µs   p(95)=19.1µs  
     http_req_connecting............: avg=428.45µs min=0s      med=0s      max=46.41ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=651.07ms min=6.88ms  med=66.37ms max=29.7s    p(90)=401.28ms p(95)=552.48ms
       { expected_response:true }...: avg=649.24ms min=6.88ms  med=66.36ms max=29.7s    p(90)=401.06ms p(95)=551.97ms
     http_req_failed................: 0.00%  1 out of 14832
     http_req_receiving.............: avg=500.3ms  min=91.12µs med=40.81ms max=29.45s   p(90)=320.92ms p(95)=405.57ms
     http_req_sending...............: avg=12.22ms  min=4.79µs  med=7.45µs  max=1.55s    p(90)=23.76µs  p(95)=42.72µs 
     http_req_tls_handshaking.......: avg=714.16µs min=0s      med=0s      max=144.26ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=138.54ms min=4.8ms   med=22.97ms max=29.09s   p(90)=60.81ms  p(95)=79.41ms 
     http_reqs......................: 14832  428.866502/s
     iteration_duration.............: avg=652.33ms min=6.96ms  med=66.46ms max=29.7s    p(90)=401.36ms p(95)=554.97ms
     iterations.....................: 14832  428.866502/s
     vus............................: 7      min=7              max=300
     vus_max........................: 300    min=300            max=300


running (0m34.6s), 000/300 VUs, 14832 complete and 0 interrupted iterations
ethz ✓ [ 100% ] 300 VUs  30s